
x = '''
VERBR: dÂ©bito/crÂ©dito consumo
VNPRV: decomp.diferenÃƒÂ§as preÃƒÂ§o multinÃƒÂ­vel
EBPRV: liquidar diferenÃƒÂ§as de preÃƒÂ§o multinÃƒÂ­vel
ZUPRV: diferenÃƒÂ§as de preÃƒÂ§o de nÃƒÂ­veis anteriores
VNPRD: alocar diferenÃƒÂ§as de preÃƒÂ§o de nÃƒÂ­vel ÃƒÂºnico
VNKDM: alocar diferenÃƒÂ§as de cÃƒÂ¢mbio de nÃƒÂ­vel ÃƒÂºnico
8439000710 LanÃƒÂ§to. Fat.Fornec. Var PreÃƒÂ§o Interc S
LanÃƒÂ§to. ContÃƒÂ¡bil
PROVISÃƒÆ’O FundaÃƒÂ§ÃƒÂ£o Arthur Bernardes
Ãƒâ€œLEO MINERAL TÃƒâ€°CNICO
'''
undict ={"Ãƒâ€œ":"Ó", "Ãƒâ€°":"É", "ÃƒÆ’":"Ã", "ÃƒÂ£":"ã", "ÃƒÂ¡":"á","ÃƒÂ¢":"ã", "ÃƒÂº":"ú","ÃƒÂ§":"ç", "nÃƒÂ":"ní", 'â€¦': '…',"â€ž":"„" ,'â€“': '–', 'â€™': '’', "â€\x9d":"”",
         "â€š":"„","â€°":"‰",
         'â€œ': '“', "â€”":'—', "Â\xad":" ",'Ã©':"é",'â‚¬':'€',
         "â€˜":"‘",'Â£':"£","Ã¢":"â","Â©":"é",'Ã£':"ã","Ãº":'ú',
         'Ã¤':'ä',"â€¢":"•",'Ã¡':'á','Ã¼':'ü',"Â¢":'¢',"Ã±":"ñ",
         'Â½':'Ž','Ã‰':'É','Â¥':'¥','Ã§':'ç','Ã´':'´','Â®':'®',
         'Â¦':'¦',"Ã¯":"ï",'Ã¶':'ö','Â´':"´","Ëœ":"˜",'Â»':'»',
         'Ã«':"ë","Ã‡":"Ç","Ã³":"ó","Ãµ":"õ","Ã®":"î","Â¾":'¾',
         "Â¼":"¼","Â°":"°","Ã–":"Ö","Ã¥":'å',"Ã¨":"è","Â¯":"¯",
         "Â¬":"¬","Ã„":"Ä","Ãœ":"Ì","Â¤":"¤","Â·":'·',
         "Â±":"±","Ã²":"ò","Ãƒ":"","ÃŸ":"ß","Ã’":"Ò",
         "Â¡":"¡","Ãª":"ê","Â«":"«",
         "Ã\x8d":"Í","Ã\x81":'Á',"Ã\xad":"í","Ã¦":"æ","Â¿":"¿","Ã¸":"ø",
         "Ã®":"î","Ã½":"ý","Ã»":"û","Ã¹":"ù","Å½":"Ž","Â¨":"¨","Âµ":"µ",
         "Â²":"²","Â³":"³","Ã¨":"è","Â¹":"¹","â„¢":"™","Ã¤":"ä","Ã“":"Ó"}
 
for item in undict:
    if item in x:
        print(item,undict[item])
        x = x.replace(item,undict[item])



print(x)